# ðŸ§¼ Data Cleaning & Exploration

Notebook ini berisi proses pembersihan dan eksplorasi awal dataset menggunakan Pandas. Dataset yang digunakan merupakan simulasi dari praktikum, dan diolah untuk menunjukkan langkah-langkah dasar sebelum dilakukan visualisasi atau analisis statistik.

ðŸŽ¯ Tujuan Notebook Ini:
-Menunjukkan pemahaman dasar kamu dalam membaca dan membersihkan data
-Menerapkan Pandas & NumPy
-Notebook ini akan menyatukan isi dari Praktikum 6 dan PSD9 yang fokus pada data tabular

In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv('../data/nilai_siswa.csv')
df.head()

    Nama  Nilai Kelas
0    Ali     80     A
1   Budi     90     B
2  Citra     78     A
3   Dina     75     C
4    Eko     85     B

In [7]:
# Cek struktur data
df.info()

# Cek nilai kosong
print("\nMissing values per kolom:")
print(df.isnull().sum())

# Isi nilai kosong dengan rata-rata
mean_nilai = df["Nilai"].mean()
df["Nilai"] = df["Nilai"].fillna(mean_nilai)


# Cek hasil akhir
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nama    5 non-null      object
 1   Nilai   5 non-null      float64
 2   Kelas   5 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

Missing values per kolom:
Nama     0
Nilai    0
Kelas    0
dtype: int64

    Nama  Nilai Kelas
0    Ali   80.0     A
1   Budi   90.0     B
2  Citra   82.5     A
3   Dina   75.0     C
4    Eko   85.0     B